test-executive-coffee.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-09 Thu 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Executive Theme Test</title>
<meta name="author" content="Jean Louis" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&family=Merriweather:wght@400;700&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="src/executive_theme/css/executive.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Executive Theme Test</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95a1716">1. 3.4. Recipes</a>
<ul>
<li><a href="#org98f3744">1.1. Coffee Recipe (V60)</a>
<ul>
<li><a href="#org92f36a7">1.1.1. Ingredients</a></li>
<li><a href="#org632e919">1.1.2. Steps</a></li>
<li><a href="#org3891416">1.1.3. Notes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org95a1716" class="outline-2">
<h2 id="org95a1716"><span class="section-number-2">1.</span> 3.4. Recipes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org98f3744" class="outline-3">
<h3 id="org98f3744"><span class="section-number-3">1.1.</span> Coffee Recipe (V60)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
:RATING: ★★★★★
:PREPTIME: 5 min
:CUSTOMID: v60-recipe
</p>

<p>
Brewing the perfect cup of coffee using the V60 method.
</p>
</div>
<div id="outline-container-org92f36a7" class="outline-4">
<h4 id="org92f36a7"><span class="section-number-4">1.1.1.</span> Ingredients</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>20g freshly ground coffee beans</li>
<li>300ml water at 96°C</li>
<li>V60 dripper and filter</li>
</ul>
</div>
</div>
<div id="outline-container-org632e919" class="outline-4">
<h4 id="org632e919"><span class="section-number-4">1.1.2.</span> Steps</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>Boil water to 96°C</li>
<li>Rinse filter with hot water</li>
<li>Add medium-fine ground coffee</li>
<li>Pour 60ml water in circular motion (bloom for 30s)</li>
<li>Slowly pour remaining water in circles</li>
<li>Total brew time: 2:30-3:00 minutes</li>
</ol>
</div>
</div>
<div id="outline-container-org3891416" class="outline-4">
<h4 id="org3891416"><span class="section-number-4">1.1.3.</span> Notes</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
&gt; "The best coffee comes from careful attention to detail."  
&gt; — Howard Schultz
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean Louis</p>
<p class="date">Created: 2026-04-09 Thu 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
